function setup() {
  createCanvas(600, 400);
}

function draw() {
  background(255);
  
  // 1. 뒷머리
  noStroke();
  fill(25, 25, 25); 
  ellipse(200, 220, 260, 280); //뒷통수
  rect(70, 200, 260, 260, 80, 80, 0, 0); //

  // 2. 얼굴 윤곽 
  fill(255, 228, 209); 
  ellipse(200, 240, 210, 240); 

  // 3. 앞머리
  fill(25, 25, 25);
  // 가르마
  arc(200, 160, 220, 120, radians(165), radians(330)); 
  arc(280, 120, 220, 120, radians(55), radians(200)); 
  
  
  // 4. 귀
  fill(255, 228, 209);
  ellipse(90, 240, 30, 45); // 왼쪽 귀
  ellipse(310, 240, 30, 45); // 오른쪽 귀

  // 5. 눈 
  fill(255); // 눈 흰자
  ellipse(155, 220, 50, 40); // 왼쪽 눈 흰자
  ellipse(245, 220, 50, 40); // 오른쪽 눈 흰자
  stroke(150, 100, 100); // 눈썹
  strokeWeight(3);      
  noFill();
  arc(155, 195, 55, 15, radians(190), radians(350)); //왼쪽
  arc(245, 195, 55, 15, radians(190), radians(350)); //오른쪽
  
  // 6. 눈동자 
  noStroke()
  fill(30); 
  ellipse(155, 220, 32, 32); // 왼쪽 눈동자
  ellipse(245, 220, 32, 32); // 오른쪽 눈동자

  // 7. 눈 하이라이트
  fill(255); 
  ellipse(163, 212, 10, 10); // 왼쪽 큰 원
  ellipse(150, 228, 5, 5);   // 왼쪽 작은 원
  ellipse(253, 212, 10, 10); // 오른쪽 큰 원
  ellipse(240, 228, 5, 5);   // 오른쪽 작은 

  // 8. 코 
  noStroke();
  fill(200, 160, 140); 
  ellipse(200, 275, 7, 10);  

  // 9. 입 
  fill(230, 110, 110); 
  arc(200, 310, 30, 15, radians(-20), radians(200)); 

  // 10. 볼터치 
  fill(255, 180, 180, 150); 
  ellipse(140, 270, 35, 20); // 왼쪽 볼
  ellipse(260, 270, 35, 20); // 오른쪽 볼


  // 11. 목
  fill(255, 228, 209);
  rect(180, 340, 40, 40, 0); // 목

  // 12. 옷 
  fill(170, 170, 185); 
  rect(80, 380, 240, 120, 60, 60, 0, 0); 
  stroke(140); // 
  strokeWeight(5);
  line(140, 381.5, 200, 400); // 왼쪽 옷깃
  line(260, 381.5, 200, 400); // 오른쪽 옷깃
  
  //13. 머리띠
  stroke(255, 200, 200); // 머리띠 색상 
  strokeWeight(12);       // 머리띠 두께
  noFill();              
  arc(200, 230, 230, 230, radians(215), radians(325));
}